{
"0": "Dolphins are highly intelligent: Dolphins have large brains relative to their body size, and they display complex behaviors like problem-solving, using tools, and even teaching each other.", 
"1": "They use echolocation: Dolphins emit sounds that bounce off objects, allowing them to \"see\" their environment through sound. This helps them navigate and hunt in murky waters.", 
"2": "Dolphins have names: Dolphins use specific whistles to identify each other, which scientists refer to as \"signature whistles\" - essentially, they call each other by name!", 
"3": "They are fast swimmers: Dolphins can reach speeds of up to 37 mph (60 km/h) when swimming, making them some of the fastest animals in the ocean.", 
"4": "Dolphins love to surf: Wild dolphins have been observed riding waves just for fun, often seen surfing alongside boats or in the wake of large ships.", 
"5": "They sleep with one eye open: Dolphins rest one half of their brain at a time while the other half remains awake to monitor the environment for predators or threats.", 
"6": "Dolphins have strong social bonds: They live in groups called pods and are known for their strong friendships, often seen playing, hunting, and protecting each other.", 
"7": "They help humans in the wild: There are documented cases of dolphins rescuing humans from shark attacks and guiding stranded people back to shore.",
"8": "They can hold their breath for long periods: Dolphins can stay underwater for up to 15 minutes, but they usually surface to breathe every few minutes.", 
"9": "Dolphins are great imitators: They can mimic the movements and vocalizations of other animals and even human behaviors, which is a sign of advanced learning ability.", 
"10": "They communicate with clicks, whistles, and body language: Dolphins use a variety of sounds and movements to communicate, including tail slaps, leaps, and jaw claps.", 
"11": "Dolphin babies are called calves: Calves are born tail-first to prevent drowning, and they stay close to their mothers for protection and nursing.", 
"12": "Dolphins can recognize themselves in mirrors: They are one of the few animals, along with great apes and elephants, that show signs of self-awareness.", 
"13": "They are playful and creative: Dolphins have been seen blowing bubble rings, playing with seaweed, and even playing \"catch\" with fish.",
"14": "There are over 40 species of dolphins: While most dolphins live in saltwater, there are also a few species of river dolphins that live in freshwater."
}