{
"0": "Dolphins have large brains relative to their body size, and they display complex behaviors like problem-solving, using tools, and even teaching each other.", 
"1": "Dolphins emit sounds that bounce off objects (echolocation), allowing them to \"see\" their environment through sound. This helps them navigate and hunt in murky waters.", 
"2": "Dolphins use specific whistles to identify each other, which scientists refer to as \"signature whistles.\" These whistles are like their names!", 
"3": "Dolphins can reach speeds of up to 37 mph (60 km/h) when swimming, making them some of the fastest animals in the ocean.", 
"4": "Wild dolphins have been observed riding waves just for fun, often seen surfing alongside boats or in the wake of large ships.", 
"5": "Dolphins rest one half of their brain at a time while the other half remains awake to monitor the environment for predators or threats.", 
"6": "Dolphins live in groups called pods and are known for their strong friendships, often seen playing, hunting, and protecting each other.", 
"7": "There are documented cases of dolphins rescuing humans from shark attacks and guiding stranded people back to shore.",
"8": "Dolphins can stay underwater for up to 15 minutes, but they usually surface to breathe every few minutes.", 
"9": "Dolphins can mimic the movements and vocalizations of other animals and even human behaviors, which is a sign of advanced learning ability.", 
"10": "Dolphins use a variety of clicks, whistles, and movements to communicate, including tail slaps, leaps, and jaw claps.", 
"11": "Calves are born tail-first to prevent drowning, and they stay close to their mothers for protection and nursing.", 
"12": "Dolphins are one of the few animals, along with great apes and elephants, that show signs of self-awareness.", 
"13": "Dolphins play by blowing bubble rings, playing with seaweed, and even playing \"catch\" with fish.",
"14": "While most dolphins live in saltwater, there are also a few species of river dolphins that live in freshwater rivers.",
"15": "The biggest member of the dolphin family is the orca (killer whale). The larger males grow up to 32ft 2in and weigh up to 22,046lbs.",
"16": "India has declared and recognises dolphins as non-human persons. This recognition means their capture and use is illegal there.",
"17": "Studies show that dolphins can see in shades of grey, as well as the blue-green spectrum.",
"18": "Dolphins blush (their bellies turn pink)! This vasodilation allows them to dump excess heat when they're active, especially during summer months."
}